// 주제 개수는 상관없습니다
export const test_topics = [
    {
        topic: "학교",
        imgUrl: "/img/학교.jpg",
    },
    {
        topic: "음식",
        imgUrl: "/img/음식.jpg",
    },
    {
        topic: "여행",
        imgUrl: "/img/여행.jpg",
    },
    {
        topic: "취미",
        imgUrl: "/img/취미.jpg",
    },
    {
        topic: "영화",
        imgUrl: "/img/영화.jpg",
    },
    {
        topic: "음악",
        imgUrl: "/img/음악.jpg",
    },
    {
        topic: "운동",
        imgUrl: "/img/운동.jpg",
    }
];

// 메인 질문 개수는 상관없습니다
export const test_mainquestions = [
    "가장 좋아하는 과목은 무엇인가요?",
    "학교에서 가장 기억에 남는 추억은 무엇인가요?",
    "학교 친구들과 자주 하는 활동은 무엇인가요?",
    "학교에서 가장 좋아하는 선생님은 누구인가요?",
    "학교 급식 중 가장 맛있었던 메뉴는 무엇인가요?",
    "방과 후 활동 중 가장 재미있었던 것은 무엇인가요?",
    "학교에서 가장 어려웠던 과목은 무엇인가요?",
    "교내 행사 중 가장 기억에 남는 것은 무엇인가요?",
    "학교 도서관에서 자주 읽었던 책은 무엇인가요?",
    "학교 친구들과 함께했던 특별한 프로젝트는 무엇인가요?"
];

//꼬리질문 개수는 5개여야 합니다
export const test_subquestions = [
    "그 과목을 좋아하게 된 특별한 이유가 있나요?",
    "그 과목에서 배운 것 중 가장 인상 깊었던 내용은 무엇인가요?",
    "그 과목을 가르치는 선생님은 어떤 분인가요?",
    "그 과목과 관련된 특별한 활동이나 프로젝트에 참여한 적이 있나요?",
    "그 과목과 관련된 진로를 생각해본 적이 있나요?"
]

//피드백 개수는 6개여야 합니다
export const test_feedback = [
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.4 / 5"
    }
]