// 주제 개수는 상관없습니다
export const test_topics = [
    {
        topic: "학교",
        imgUrl: "/img/학교.jpg",
    },
    {
        topic: "음식",
        imgUrl: "/img/음식.jpg",
    },
    {
        topic: "여행",
        imgUrl: "/img/여행.jpg",
    },
    {
        topic: "취미",
        imgUrl: "/img/취미.jpg",
    },
    {
        topic: "영화",
        imgUrl: "/img/영화.jpg",
    },
    {
        topic: "음악",
        imgUrl: "/img/음악.jpg",
    },
    {
        topic: "운동",
        imgUrl: "/img/운동.jpg",
    }
];

// 메인 질문 개수는 상관없습니다
export const test_mainquestions = [
    "운동할 때 친구랑 같이 하면 더 재미있지? 왜 그럴까?",
    "운동하다가 친구가 넘어지면 너는 어떻게 할 거야?",
    "축구할 때 규칙을 안 지키면 어떤 일이 생길까?",
    "친구가 농구를 어려워하면 너는 어떻게 도와줄 거야?",
    "운동하면서 쓰레기를 그냥 버리면 안 되는 이유가 뭘까?",
];

//꼬리질문 개수는 5개여야 합니다
export const test_subquestions = [
    "친구가 다쳤을 때 먼저 해야 할 일은 뭐야?",
    "너도 다친 적이 있으면 친구가 어떻게 도와줬어?",
    "친구를 도와준 후에 기분이 어땠어?",
    "친구를 도와주면서 배운 점이 있다면 뭐야?",
]

//피드백 개수는 6개여야 합니다
export const test_feedback = [
    {
        feedback: "잘했어요! 친구가 다쳤을 때 바로 도움을 주려는 마음은 아주 좋은 태도에요. 일상 대화에서 이렇게 상대방의 감정을 이해하고 응답하는 것은 매우 중요한 부분이랍니다. 계속해서 이런 방식으로 대화를 이어가 보세요.",
        score: "발음 평가 : 3.4 / 5"
    },
    {
        feedback: "간단하게라도 이유를 말해주면  대화가 더 흥미로워질 수 있어요. 예를 들어, ‘그냥 좋아’ 대신 ‘그냥 색칠하는 게 재미있어서 좋아’라고 하면 더 좋아요.",
        score: "발음 평가 : 2.5 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 3.7 / 5"
    },
    {
        feedback: "간단하게라도 이유를 말해주면  대화가 더 흥미로워질 수 있어요. 예를 들어, ‘그냥 좋아’ 대신 ‘그냥 색칠하는 게 재미있어서 좋아’라고 하면 더 좋아요.",
        score: "발음 평가 : 4.0 / 5"
    },
    {
        feedback: "잘했어요! 왜 체육이 가장 좋았는지 이유까지 설명해서 상대방이 더 잘 이해할 수 있도록 했네요. 이렇게 이유를 덧붙이면 대화가 더욱 풍부해질 수 있어요. Keep it up!",
        score: "발음 평가 : 4.1 / 5"
    },
    {
        feedback: "간단하게라도 이유를 말해주면  대화가 더 흥미로워질 수 있어요. 예를 들어, ‘그냥 좋아’ 대신 ‘그냥 색칠하는 게 재미있어서 좋아’라고 하면 더 좋아요.",
        score: "발음 평가 : 3.9 / 5"
    },
]